/* Time-limit options in popup-menu for x month(s) and y week(s). This is a fallback string that should not be displayed to the user */
"%d months and %d weeks" = "%1$d kuukautta ja %2$d viikkoa";

/* Time-limit options in popup-menu for x Month(s) and y Week(s) ago. This is a fallback string that should not be displayed to the user */
"%d Months and %d Weeks ago" = "%1$d kuukautta ja %2$d viikkoa";

/* This texts follows the actual time zone if the system time zone is used. Note the parenthesis. */
"(Using System Time Zone)" = "(Käytetään järjestelmän aikavyöhykettä)";

/* We display a list of records inline.  When there are more than 5 records, we onlye display the first 5, then the current message to inform how many remains */
", and %d more." = " ja %d lisää.";

/* at this place, we display the summary of an event.  This is what we will display when the event does not have any summary */
"<event with no summary>" = "<tapahtumalla ei ole yhteenvetoa>";

/* at this place, we display the summary of a task.  This is what we will display when the task does not have any summary */
"<task with no summary>" = "<tehtävällä ei ole yhteenvetoa>";

/* at this place, we display the name of contact group.  This is what we will display when the contact group does not have any name */
"<unamed group>" = "<nimetön ryhmä>";

/* at this place, we display the name of contact.  This is what we will display when the contact does not have any name */
"<unknown contact>" = "<tuntematon yhteystieto>";

/* All Contacts - iSync Phone Conduit */
"All Contacts" = "Kaikki yhteystiedot";

/* Comments below the 'Sync All-day events' checkbox */
"All-day events become read-only events on your phone." = "Koko päivän tapahtumista tulee kirjoitussuojattuja tapahtumia puhelimessa.";

/* Suggestion of the window: No calendar available */
"Before you can synchronize your calendars, you need to open a calendar application that supports Mac OS X synchronization." = "Ennen kuin voit synkronoida kalentereita, sinun on avattava kalenteriohjelma, joka tukee Mac OS X -synkronointia.";

/* Contacts stat. */
"Calendar events changed: %d added, %d modified and %d removed" = "Muutettuja kalenteritapahtumia: %1$d lisätty, %2$d muutettu ja %3$d poistettu";

/* Calendars */
"Calendars" = "Kalenterit";

/* Generic Cancel button in dialog */
"Cancel" = "Kumoa";

/* Contacts */
"Contacts" = "Yhteystiedot";

/* Contacts stat. */
"Contacts changed: %d added, %d modified and %d removed" = "Muutettuja yhteystietoja: %1$d lisätty, %2$d muutettu ja %3$d poistettu";

/* title of the window: No calendar available */
"Do you want to use iCal as your calendar application?" = "Haluatko käyttää iCalia kalenteriohjelmana?";

/* Time-limit options in popup-menu for [the next:] 8 months */
"Eight months" = "8 kuukautta";

/* Time-limit options in popup-menu for [the next:] 8 weeks */
"Eight weeks" = "8 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 8 weeks ago */
"Eight weeks ago" = "8 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 8 months ago */
"Eighth months ago" = "8 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 11 months ago */
"Eleven months ago" = "11 kuukautta";

/* Time-limit options in popup-menu for [the next:] 11 months */
"Elevent months" = "11 kuukautta";

/* Following that label will be a list of events (one or several) */
"Event(s)" = "Tapahtumat";

/* Time-limit options in popup-menu for [the next:] 5 months */
"Five months" = "5 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 5 months ago */
"Five months ago" = "5 kuukautta";

/* Time-limit options in popup-menu for [the next:] 5 weeks */
"Five weeks" = "5 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 5 weeks ago */
"Five weeks ago" = "5 viikkoa";

/* Time-limit options in popup-menu for [the next:] 4 months */
"Four months" = "4 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 4 months ago */
"Four months ago" = "4 kuukautta";

/* Time-limit options in popup-menu for [the next:] 4 weeks */
"Four weeks" = "4 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 4 weeks ago */
"Four weeks ago" = "4 viikkoa";

/* Merge button in dialog */
"Merge" = "Yhdistä";

/* title of the window: Merge on first sync */
"Merging information for your first sync may result in some duplicate contact or calendar information." = "Tietojen yhdistäminen ensimmäisen synkronoinnin aikana saattaa aiheuttaa yhteys- tai kalenteritietojen kahdentumista.";

/* Time-limit options in popup-menu for [the next:] 9 months */
"Nine months" = "9 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 9 months ago */
"Nine months ago" = "9 kuukautta";

/* Time-limit options in popup-menu for: NO LIMIT */
"No limit" = "Rajoittamaton";

/* Time-limit options in popup-menu for [the next:] 1 month */
"One month" = "1 kuukausi";

/* Time-limit options in popup-menu for [prior to:] 1 month ago */
"One month ago" = "kuukautta";

/* Time-limit options in popup-menu for [the next:] 1 week */
"One week" = "1 viikko";

/* Time-limit options in popup-menu for [prior to:] 1 week ago */
"One week ago" = "viikkoa";

/* Time-limit options in popup-menu for [the next:] 1 year */
"One year" = "1 vuosi";

/* Time-limit options in popup-menu for [prior to:] 1 year ago */
"One year ago" = "1 vuosi";

/* button to open iCal */
"Open iCal" = "Avaa iCal";

/* Name for the Personal Information (Sync) module in the navigation bar */
"Personal Information" = "Henkilötiedot";

/* For 3rd-party plugin, displayed at the bottom of the main view: Provided by %@    [%@ is the manufacturer name] */
"Provided by %@" = "Toimittanut: %@";

/* Label in modlet view */
"Put events created on phone into:" = "Laita puhelimeen luodut tapahtumat:";

/* Reset button in dialog */
"Reset" = "Palauta";

/* Time-limit options in popup-menu for [the next:] 7 months */
"Seven months" = "7 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 7 months ago */
"Seven months ago" = "7 kuukautta";

/* Time-limit options in popup-menu for [the next:] 7 weeks */
"Seven weeks" = "7 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 7 weeks ago */
"Seven weeks ago" = "7 viikkoa";

/* Time-limit options in popup-menu for [the next:] 6 months */
"Six months" = "6 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 6 months ago */
"Six months ago" = "6 kuukautta";

/* Time-limit options in popup-menu for [the next:] 6 weeks */
"Six weeks" = "6 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 6 weeks ago */
"Six weeks ago" = "6 viikkoa";

/* For 3rd-party plugin, displayed at the bottom of the main view: Support */
"Support" = "Tuki";

/* Label in modlet view in front of contact group popup */
"Synchronize:" = "Synkronoi:";

/* Following that label will be a list of tasks (one or several) */
"Task(s)" = "Tehtävät";

/* Time-limit options in popup-menu for [the next:] 10 months */
"Ten months" = "10 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 10 months ago */
"Ten months ago" = "10 kuukautta";

/* the phone refused some events or contacts for unknown reasons.  We give a list of the incriminated records */
"The device refused the following records:\n" = "Laite hylkäsi seuraavat tietueet:\n";

/* Suggestion of the window: merge on first sync. %@ == [application name] */
"The first time you use %@ to synchronize devices that were imported from iSync 1.5, you should reset the information on your devices to avoid duplicates." = "Kun synkronoit iSync 1.5:stä tuodut laitteet ensimmäistä kertaa %@ -ohjelman avulla, laitteissa olevat tiedot kannattaa nollata kaksoiskappaleiden välttämiseksi.";

/* Text displayed instead of the calendars section when the phone does not support calendars sync */
"This phone does not support calendar synchronization." = "Puhelin ei tue kalentereiden synkronointia.";

/* Time-limit options in popup-menu for [the next:] 3 months */
"Three months" = "3 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 3 months ago */
"Three months ago" = "3 kuukautta";

/* Time-limit options in popup-menu for [the next:] 3 weeks */
"Three weeks" = "3 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 3 weeks ago */
"Three weeks ago" = "3 viikkoa";

/* Time-limit options in popup-menu for [prior to:] Today */
"Today" = "päivää";

/* Turn on [DeviceName] synchronization */
"Turn on %@ synchronization" = "Ota käyttöön %@ synkronointi";

/* Time-limit options in popup-menu for [the next:] 2 months */
"Two months" = "2 kuukautta";

/* Time-limit options in popup-menu for [prior to:] 2 months ago */
"Two months ago" = "2 kuukautta";

/* Time-limit options in popup-menu for [the next:] 2 weeks */
"Two weeks" = "2 viikkoa";

/* Time-limit options in popup-menu for [prior to:] 2 weeks ago */
"Two weeks ago" = "kahta viikkoa";

/* Time-limit options in popup-menu for [the next:] 2 years */
"Two years" = "2 vuotta";

/* Using System Time Zone */
"Using System Time Zone" = "Käytetään järjestelmän aikavyöhykettä";

